src/Documents/ПередачаСредствВДолг/ПередачаСредствВДолг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаСредствВДолг</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипОперацииДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ВидОперацииДолга/ВидОперацииДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииДолга</name>
  <enumValues>
    <name>ДаюВДолг</name>
  </enumValues>
  <enumValues>
    <name>БеруВДолг</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипОперацииДолга/ТипОперацииДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОперацииДолга</name>
  <enumValues>
    <name>ВыдачаДенег</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенег</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПередачаСредствВДолг/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма документа ПередачаСредствВДолг.
// HTML-интерфейс «Долги» по макету Wallet.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Дата = ТекущаяДата();
		Объект.Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
		Объект.ВидОперации = Перечисления.ВидОперацииДолга.ДаюВДолг;
		Объект.ТипОперации = Перечисления.ТипОперацииДолга.ВыдачаДенег;
		ЗаполнитьСчетПоУмолчанию();
		
	Иначе
		
		ДозаполнитьТипОперацииДляСтарыхДокументов();
		
	КонецЕсли;
	
	Заголовок = "Долги";
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "ВыборДаты" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РежимВыбораДаты = "due" Тогда
		
		Объект.СрокВозврата = НачалоДня(Параметр.Период);
		
	Иначе
		
		Если ЗначениеЗаполнено(Параметр.Время) Тогда
			
			Часов = Час(Параметр.Время);
			Минут = Минута(Параметр.Время);
			Секунд = Секунда(Параметр.Время);
			ВсегоСекунд = Часов * 3600 + Минут * 60 + Секунд;
			
		Иначе
			
			ВсегоСекунд = 0;
			
		КонецЕсли;
		
		Объект.Дата = Параметр.Период + ВсегоСекунд;
		
	КонецЕсли;
	
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбработатьКомандуHTML(КомандаПриложения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьКомандуHTML(КомандаПриложения)
	
	Если КомандаПриложения = "back" Тогда
		
		Закрыть();
		
	ИначеЕсли КомандаПриложения = "dir:owe" Тогда
		
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииДолга.БеруВДолг");
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "dir:owed" Тогда
		
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииДолга.ДаюВДолг");
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "op:issue" Тогда
		
		Объект.ТипОперации = ПредопределенноеЗначение("Перечисление.ТипОперацииДолга.ВыдачаДенег");
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "op:return" Тогда
		
		Объект.ТипОперации = ПредопределенноеЗначение("Перечисление.ТипОперацииДолга.ВозвратДенег");
		ОбновитьHTMLНаСервере();
		
	ИначеЕсли КомандаПриложения = "edit-sum" Тогда
		
		НачатьВводСуммы();
		
	ИначеЕсли КомандаПриложения = "contact" Тогда
		
		НачатьВыборКонтакта();
		
	ИначеЕсли КомандаПриложения = "account" Тогда
		
		НачатьВыборСчета();
		
	ИначеЕсли КомандаПриложения = "date" Тогда
		
		НачатьВыборДаты("date");
		
	ИначеЕсли КомандаПриложения = "due" Тогда
		
		НачатьВыборДаты("due");
		
	ИначеЕсли КомандаПриложения = "edit-comment" Тогда
		
		НачатьВводКомментария();
		
	ИначеЕсли КомандаПриложения = "submit" Тогда
		
		ЗаписатьДокументДолга();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводСуммы()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаСуммы", ЭтотОбъект);
	РежимЦвета = ?(Объект.ТипОперации = ПредопределенноеЗначение("Перечисление.ТипОперацииДолга.ВозвратДенег"),
		"income", "expense");
	ОбщийМодульКлиент.ПоказатьВводСуммы(ОписаниеОповещения, Объект.Сумма, "Сумма операции", РежимЦвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСуммы(Число, ДополнительныеПараметры) Экспорт
	
	Если Число = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Число < 0 Тогда
		
		Число = 0;
		
	КонецЕсли;
	
	Объект.Сумма = Число;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборКонтакта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Если ЗначениеЗаполнено(Объект.Контакт) Тогда
		
		ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Контакт);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораКонтакта", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контакты.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтакта(ВыбранныйКонтакт, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйКонтакт = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Контакт = ВыбранныйКонтакт;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборСчета()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСчета", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВыборСчета(ОписаниеОповещения, Объект.Счет, "Счет");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСчета(ВыбранныйСчет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйСчет = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Счет = ВыбранныйСчет;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборДаты(Режим)
	
	РежимВыбораДаты = Режим;
	ПараметрыКалендаря = Новый Структура;
	ПараметрыКалендаря.Вставить("ТолькоДата", Истина);
	
	Если Режим = "due" Тогда
		
		Если ЗначениеЗаполнено(Объект.СрокВозврата) Тогда
			
			ПараметрыКалендаря.Вставить("Дата", Объект.СрокВозврата);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Дата) Тогда
		
		ПараметрыКалендаря.Вставить("Дата", Объект.Дата);
		
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", ПараметрыКалендаря, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводКомментария()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВводТекста(ОписаниеОповещения, Объект.Комментарий, "Комментарий", 200);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКомментария(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Комментарий = Лев(Строка, 200);
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументДолга()
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		ПоказатьПредупреждение(, "Выберите тип долга.");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипОперации) Тогда
		
		ПоказатьПредупреждение(, "Выберите тип операции.");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Сумма <= 0 Тогда
		
		ПоказатьПредупреждение(, "Укажите сумму операции больше нуля.");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контакт) Тогда
		
		ПоказатьПредупреждение(, "Выберите контакт.");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Счет) Тогда
		
		ПоказатьПредупреждение(, "Выберите счёт.");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		Объект.Валюта = ПолучитьВалютуУчетаНаСервере();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли;
	
	// Запись из OnClick HTML на мобильном клиенте надёжнее через отложенный вызов.
	ПодключитьОбработчикОжидания("ВыполнитьЗаписьДокументаДолга", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьДокументаДолга()
	
	ТекстОшибки = ЗаписатьИПровестиНаСервере();
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		
		Закрыть(Истина);
		
	Иначе
		
		ПоказатьПредупреждение(, ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИПровестиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		Объект.Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Возврат "Выберите тип долга.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипОперации) Тогда
		
		Возврат "Выберите тип операции.";
		
	КонецЕсли;
	
	Если Объект.Сумма <= 0 Тогда
		
		Возврат "Укажите сумму операции больше нуля.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контакт) Тогда
		
		Возврат "Выберите контакт.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Счет) Тогда
		
		Возврат "Выберите счёт.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		Возврат "Не заполнена валюта учёта.";
		
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВалютуУчетаНаСервере()
	
	Возврат ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
	
КонецФункции

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	ТекстHTML = СобратьHTMLФормыДолга();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетПоУмолчанию()
	
	Если ЗначениеЗаполнено(Объект.Счет) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Кошелек.Ссылка КАК Счет
	|ИЗ
	|	Справочник.Счета КАК Кошелек
	|ГДЕ
	|	НЕ Кошелек.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Кошелек.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Объект.Счет = Выборка.Счет;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьТипОперацииДляСтарыхДокументов()
	
	Если ЗначениеЗаполнено(Объект.ТипОперации) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидОперацииДолга.БеруВДолг Тогда
		
		Объект.ТипОперации = Перечисления.ТипОперацииДолга.ВозвратДенег;
		
	Иначе
		
		Объект.ТипОперации = Перечисления.ТипОперацииДолга.ВыдачаДенег;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СобратьHTMLФормыДолга()
	
	МнеДолжны = (Объект.ВидОперации = Перечисления.ВидОперацииДолга.ДаюВДолг);
	ВозвратДенег = (Объект.ТипОперации = Перечисления.ТипОперацииДолга.ВозвратДенег);
	ЦветСуммы = ?(ВозвратДенег, "#16A34A", "#DC2626");
	
	СуммаТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчетаДляHTML(Объект.Сумма, Ложь);
	
	Если Объект.Сумма <= 0 Тогда
		
		СуммаТекст = "0&nbsp;" + ЭкранироватьHTML(ОбщийМодульСервер_КурсыВалют.СимволВалюты(
			ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета()));
		
	КонецЕсли;
	
	ИмяКонтакта = ?(ЗначениеЗаполнено(Объект.Контакт), Строка(Объект.Контакт), "Выберите контакт");
	КлассКонтакта = ?(ЗначениеЗаполнено(Объект.Контакт), "", "placeholder");
	ИмяСчета = ?(ЗначениеЗаполнено(Объект.Счет), Строка(Объект.Счет), "Выберите счёт");
	КлассСчета = ?(ЗначениеЗаполнено(Объект.Счет), "", "placeholder");
	
	ТекстДаты = ?(ЗначениеЗаполнено(Объект.Дата), Формат(Объект.Дата, "ДФ=dd.MM.yyyy"), "Выберите дату");
	КлассДаты = ?(ЗначениеЗаполнено(Объект.Дата), "", "placeholder");
	ТекстСрока = ?(ЗначениеЗаполнено(Объект.СрокВозврата), Формат(Объект.СрокВозврата, "ДФ=dd.MM.yyyy"), "Укажите срок");
	КлассСрока = ?(ЗначениеЗаполнено(Объект.СрокВозврата), "", "placeholder");
	
	Комментарий = СокрЛП(Объект.Комментарий);
	ТекстКомментария = ?(ПустаяСтрока(Комментарий), "Добавить комментарий", Комментарий);
	КлассКомментария = ?(ПустаяСтрока(Комментарий), "placeholder", "");
	
	МожноЗаписать = ЗначениеЗаполнено(Объект.ВидОперации)
		И ЗначениеЗаполнено(Объект.ТипОперации)
		И Объект.Сумма > 0
		И ЗначениеЗаполнено(Объект.Контакт)
		И ЗначениеЗаполнено(Объект.Счет);
	КлассКнопки = "submit";
	ПодписьКнопки = ?(МожноЗаписать, "Записать", "Заполнить обязательные поля");
	
	Строки = Новый Массив;
	Строки.Добавить("<!DOCTYPE html><html lang=""ru""><head><meta charset=""utf-8"">");
	Строки.Добавить("<meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"">");
	Строки.Добавить("<style>" + СтилиФормыДолга() + "</style></head><body>");
	
	Строки.Добавить("<div class=""top"">");
	Строки.Добавить("<a class=""icon-btn"" href=""app:back"">" + SVGСтрелкаНазад() + "</a>");
	Строки.Добавить("<div class=""title"">Долги</div>");
	Строки.Добавить("<span class=""icon-btn ghost""></span></div>");
	
	Строки.Добавить("<div class=""seg"">");
	Строки.Добавить("<a class=""seg-item" + ?(Не МнеДолжны, " active", "") + """ href=""app:dir:owe"">Я должен</a>");
	Строки.Добавить("<a class=""seg-item" + ?(МнеДолжны, " active", "") + """ href=""app:dir:owed"">Мне должны</a>");
	Строки.Добавить("</div>");
	
	Строки.Добавить("<div class=""card"">");
	Строки.Добавить("<div class=""card-title"">Тип операции</div>");
	Строки.Добавить("<div class=""seg inner"">");
	Строки.Добавить("<a class=""seg-item" + ?(Не ВозвратДенег, " active", "") + """ href=""app:op:issue"">Выдача денег</a>");
	Строки.Добавить("<a class=""seg-item" + ?(ВозвратДенег, " active", "") + """ href=""app:op:return"">Возврат денег</a>");
	Строки.Добавить("</div></div>");
	
	Строки.Добавить("<a class=""amount-block"" href=""app:edit-sum"">");
	Строки.Добавить("<div class=""amount"" style=""color:" + ЦветСуммы + """>" + СуммаТекст + "</div>");
	Строки.Добавить("<div class=""amount-lbl"">Сумма операции</div></a>");
	
	Строки.Добавить(HTMLПоле("contact", "Контакт", ИмяКонтакта, КлассКонтакта, SVGКонтакт()));
	Строки.Добавить(HTMLПоле("account", "Счет", ИмяСчета, КлассСчета, SVGКарта()));
	Строки.Добавить(HTMLПоле("date", "Дата", ТекстДаты, КлассДаты, SVGКалендарь()));
	Строки.Добавить(HTMLПоле("due", "Срок возврата", ТекстСрока, КлассСрока, SVGКалендарь()));
	
	Строки.Добавить("<a class=""field comment"" href=""app:edit-comment"">");
	Строки.Добавить("<div class=""field-lbl"">Комментарий</div>");
	Строки.Добавить("<div class=""field-val " + КлассКомментария + """>" + ЭкранироватьHTML(ТекстКомментария) + "</div>");
	Строки.Добавить("</a>");
	
	Строки.Добавить("<div class=""actions"">");
	Строки.Добавить("<a class=""" + КлассКнопки + """ href=""app:submit"">" + ПодписьКнопки + "</a>");
	Строки.Добавить("</div>");
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

&НаСервере
Функция HTMLПоле(Команда, Подпись, Значение, КлассЗначения, SVG)
	
	Возврат "<a class=""field"" href=""app:" + Команда + """>"
		+ "<div class=""field-mid""><div class=""field-lbl"">" + ЭкранироватьHTML(Подпись) + "</div>"
		+ "<div class=""field-val " + КлассЗначения + """>" + ЭкранироватьHTML(Значение) + "</div></div>"
		+ "<div class=""field-ico"">" + SVG + "</div></a>";
	
КонецФункции

&НаСервере
Функция СтилиФормыДолга()
	
	Возврат "*{box-sizing:border-box;margin:0;padding:0;-webkit-tap-highlight-color:transparent}"
		+ "body{font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,Arial,sans-serif;background:#FAFAFA;"
		+ "color:#111827;padding:12px 16px 24px;line-height:1.3}"
		+ "a{text-decoration:none;color:inherit;-webkit-user-select:none;user-select:none}"
		+ ".top{display:flex;align-items:center;justify-content:space-between;margin-bottom:14px}"
		+ ".title{font-size:18px;font-weight:700;color:#111827}"
		+ ".icon-btn{width:36px;height:36px;border-radius:50%;background:#F3F4F6;display:flex;align-items:center;"
		+ "justify-content:center;color:#6B7280}"
		+ ".icon-btn.ghost{visibility:hidden}"
		+ ".seg{display:flex;background:#F3F4F6;border-radius:14px;padding:4px;margin-bottom:12px}"
		+ ".seg.inner{margin:0;background:#F3F4F6}"
		+ ".seg-item{flex:1;text-align:center;padding:10px 8px;border-radius:10px;font-size:14px;font-weight:700;"
		+ "color:#6B7280}"
		+ ".seg-item.active{background:#2563EB;color:#fff;box-shadow:0 2px 8px rgba(37,99,235,0.25)}"
		+ ".card{background:#fff;border:1px solid #E5E7EB;border-radius:16px;padding:14px;margin-bottom:12px;"
		+ "box-shadow:0 1px 3px rgba(17,24,39,0.04)}"
		+ ".card-title{font-size:13px;font-weight:700;color:#6B7280;margin-bottom:10px}"
		+ ".amount-block{display:block;text-align:center;padding:18px 8px 20px}"
		+ ".amount{font-size:36px;font-weight:700;letter-spacing:-0.02em}"
		+ ".amount-lbl{margin-top:6px;font-size:13px;font-weight:600;color:#6B7280}"
		+ ".field{display:flex;align-items:center;background:#fff;border:1px solid #E5E7EB;border-radius:12px;"
		+ "padding:12px 14px;margin-bottom:8px}"
		+ ".field.comment{display:block;min-height:72px}"
		+ ".field-mid{flex:1;min-width:0}"
		+ ".field-lbl{font-size:12px;font-weight:600;color:#6B7280;margin-bottom:2px}"
		+ ".field-val{font-size:15px;font-weight:700;color:#111827;white-space:nowrap;overflow:hidden;"
		+ "text-overflow:ellipsis}"
		+ ".field-val.placeholder{color:#9CA3AF;font-weight:500}"
		+ ".field.comment .field-val{white-space:pre-wrap;font-weight:600}"
		+ ".field-ico{width:28px;height:28px;border-radius:8px;background:#F3F4F6;color:#9CA3AF;display:flex;"
		+ "align-items:center;justify-content:center;flex-shrink:0;margin-left:10px}"
		+ ".actions{margin-top:16px;padding-bottom:8px}"
		+ ".submit{display:flex;align-items:center;justify-content:center;height:52px;background:#2563EB;color:#fff;"
		+ "border-radius:14px;font-size:16px;font-weight:700;box-shadow:0 6px 16px rgba(37,99,235,0.28)}"
		+ ".submit.disabled{background:#E5E7EB;color:#9CA3AF;box-shadow:none}";
	
КонецФункции

&НаСервере
Функция SVGСтрелкаНазад()
	
	Возврат "<svg width=""18"" height=""18"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M15 18l-6-6 6-6""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGКонтакт()
	
	Возврат "<svg width=""16"" height=""16"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><path d=""M20 21v-2a4 4 0 0 0-4-4H8a4 4 0 0 0-4 4v2""/><circle cx=""12"" cy=""7"" r=""4""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGКарта()
	
	Возврат "<svg width=""16"" height=""16"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><rect x=""2"" y=""5"" width=""20"" height=""14"" rx=""2""/><path d=""M2 10h20""/></svg>";
	
КонецФункции

&НаСервере
Функция SVGКалендарь()
	
	Возврат "<svg width=""16"" height=""16"" viewBox=""0 0 24 24"" fill=""none"" stroke=""currentColor"" stroke-width=""2"" stroke-linecap=""round"" stroke-linejoin=""round""><rect x=""3"" y=""4"" width=""18"" height=""18"" rx=""2""/><path d=""M16 2v4""/><path d=""M8 2v4""/><path d=""M3 10h18""/></svg>";
	
КонецФункции

&НаСервере
Функция ЭкранироватьHTML(Знач Текст)
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(Знач АдресСсылки)
	
	Если Не ЗначениеЗаполнено(АдресСсылки) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	АдресСсылки = СокрЛП(АдресСсылки);
	Позиция = СтрНайти(НРег(АдресСсылки), "app:");
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Сред(АдресСсылки, Позиция + 4);
	
КонецФункции

#КонецОбласти
